#include <fstream>
#include <iostream>

int main()
{
    std::ifstream f;
    char buf[4];
    f.open("jpmi.png", std::ios::binary);
    f.read(buf, sizeof(buf));
    if ((int)buf[0] == -119 && buf[1] == 'P' && buf[2] == 'N' && buf[3] == 'G')
    {
        std::cout << "png";
    }
    else
    {
        std::cout << "this is not png";
    }
    f.close();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
